package main.java.chapter_7;

/*
 * Напишите программу которая выводит на экран числа от 1 до 10.
 */
public class Main {
    public static void main(String[] args) {
        for (int i = 1; i < 11; i++) {
            System.out.println(i);
        }
    }
}
