package main.java.chapter_1;

/*
 * Напишите программу которая выводит на экран фразу "Hello, SpaceLab Java!".
 * Изучите и объясните каждое слово строки public static void main(String[] args).
 */
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello SpaceLab Java!");
    }
}
